In [1]:
import pandas as pd
import numpy as np

In [12]:
df=pd.read_csv("BOOK1.csv")

In [13]:
df

   ST_NUM    ST_NAME  NUM_BED OWN_OCC
0   104.0    PUTNAME      3.0       Y
1   197.0  LEXINGTON      3.0       N
2     NaN  LEXINGTON      NaN       N
3   201.0   BERKELEY      1.0       Y
4   203.0   BERKELEY      3.0       Y
5   207.0   BERKELEY      NaN       Y
6     NaN   WASINTON      2.0     NaN
7   213.0    TREMONT      NaN       Y
8   215.0    TREMONT      NaN       N

In [3]:
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [4]:
print(df['NUM_BED'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: NUM_BED, dtype: bool

In [5]:
mvalue=["NA","n/a","  "]

In [6]:
print(mvalue)

['NA', 'n/a', '  ']

In [7]:
import pandas as pd

In [8]:
df=pd.read_csv("BOOK1.csv",na_values=mvalue)

In [10]:
df

   ST_NUM    ST_NAME  NUM_BED OWN_OCC
0   104.0    PUTNAME      3.0       Y
1   197.0  LEXINGTON      3.0       N
2     NaN  LEXINGTON      NaN       N
3   201.0   BERKELEY      1.0       Y
4   203.0   BERKELEY      3.0       Y
5   207.0   BERKELEY      NaN       Y
6     NaN   WASINTON      2.0     NaN
7   213.0    TREMONT      NaN       Y
8   215.0    TREMONT      NaN       N

In [13]:
print(df['OWN_OCC'].isnull())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCC, dtype: bool

In [14]:
print(df.isnull().sum())

ST_NUM     2
ST_NAME    0
NUM_BED    4
OWN_OCC    1
dtype: int64

In [19]:
df['ST_NUM'].fillna(125,inplace=True)

In [24]:
print(df['ST_NUM'])

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64